EchoWebLV/daemon-agent-device/sdkconfig.defaults
# -----------------------------------------------------------------------------
#  ESP-IDF sdkconfig defaults for Daemon.
#
#  Anything set here is applied on a fresh build. After the first build a full
#  `sdkconfig` is generated from these + IDF defaults; regenerate it by
#  deleting `.pio/build/<env>/sdkconfig` and rebuilding.
# -----------------------------------------------------------------------------

# ---- Target chip ------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash ------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- Custom partition table -------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM (8 MB octal-SPI on this board) -----------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Allocations smaller than this threshold go to internal RAM (fast); bigger
# ones fall through to PSRAM. 16 KB matches the Arduino-ESP32 default.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ---- CPU --------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ---- Console over native USB Serial/JTAG (no external chip on this board) --
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# ---- FreeRTOS ---------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ---- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# ---- LWIP (HTTPS to ElevenLabs / Solana RPC expects reasonable buffers) ----
CONFIG_LWIP_MAX_ACTIVE_TCP=16
CONFIG_LWIP_MAX_LISTENING_TCP=8

# Total socket pool. Default (10) gets exhausted under combined load
# (httpd's listen + 2 accepted, mDNS x2, then any outbound HTTPS for
# AI / RPC / voice / wallet refresh races them). With 'esp-tls: Failed
# to create socket' visible on hardware, bump to 16. Each socket is a
# few hundred bytes of internal RAM — fine.
CONFIG_LWIP_MAX_SOCKETS=16

# Drop TCP TIME_WAIT from 60 s to 3 s. A closed outbound HTTPS socket
# normally squats a slot for the full MSL (60 s default), so a quick
# burst of AI + voice + RPC calls saturates the pool and the next
# socket() returns -1 (visible as 'Failed to create socket'). 3 s is
# safe on a private LAN with short round-trips and saves us from the
# wedged-pool failure mode entirely.
CONFIG_LWIP_TCP_MSL=3000

# ---- mbedTLS (bigger record buffer so Gemini / ElevenLabs chunks fit) ------
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Route mbedTLS allocations to PSRAM instead of internal DRAM. With the
# 16 KB IN + 4 KB OUT record buffers above, *each* concurrent TLS handle
# needs ~25 KB of DRAM — and we have three talking at once (wallet RPC,
# Solana x402 chat, ElevenLabs TTS). Internal DRAM after Wi-Fi / LwIP /
# LVGL is ~220 KB, which is too tight: mbedtls_ssl_setup() starts
# returning -0x7F00 (MBEDTLS_ERR_SSL_ALLOC_FAILED) when they race at
# boot. PSRAM is fine for mbedTLS record buffers (crypto accelerators
# have their own DMA memory) and we have 8 MB of it to spare. Also flip
# on the dynamic RX/TX buffers so an idle SSL handle drops its 20 KB of
# record buffers until the next request.
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# ---- ESP-SR (wake word + VAD via AFE) --------------------------------------
# WakeNet9 placeholder. wn9_hiesp ("Hi ESP") is trained on English speakers
# and detects reliably for the demo without waiting on a custom model. Swap
# to `CONFIG_SR_WN_WN9_HEYDAEMON=y` (or whatever symbol the WakeNet generator
# returns) once the custom "Hey Daemon" model arrives. Both the Espressif
# customization process and third-party services (e.g. custom-espsr.com)
# produce compatible WN9 models.
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_VADN_VADNET1_MEDIUM=y

# ---- mbedTLS hardware AES OFF ---------------------------------------------
# AFE's working buffers consume enough DMA-capable internal RAM that the
# hardware AES accelerator's small DMA descriptor allocation now fails:
# `esp-aes: Failed to allocate memory` followed by `esp-tls-mbedtls:
# write error :-0x0001` on every TLS handshake (STT POST, x402 chat,
# ElevenLabs TTS). Software AES on the S3 at 240 MHz is comfortably fast
# enough for the ~127 KB STT POST and the streaming chat body, and uses
# plain heap that PSRAM-backed mbedTLS can satisfy.
CONFIG_MBEDTLS_HARDWARE_AES=n

# ---- LVGL extras -----------------------------------------------------------
# QR code lib: wallet screen renders the device pubkey as a QR so a phone
# wallet can scan it without typing 44 base58 chars.
CONFIG_LV_USE_QRCODE=y

# Allocator: route LVGL through libc malloc instead of LVGL's built-in TLSF
# pool. The built-in pool defaults to a small fixed size and was choking on
# wifi-screen redraws (long mapping_search walks under task watchdog), and
# the system heap has access to all of PSRAM via heap_caps so there's no
# practical pressure on LVGL allocations from the bigger screens.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
